import re

def extract_sku_list(filename):
    r"""
    Извлекает из текстового файла все артикулы (SKU) товаров.

    filename (str) — имя (путь) текстового файла, который ужно открыть и обработать.
    list[str] — список найденных артикулов/SKU в порядке их появления в тексте. Если файл не найден — возвращает None (и печатает сообщение об ошибке).
    Регулярное выражение: r"(?:SKU|[Аа]ртикул)\s*:?\s*([A-Za-zА-Яа-я0-9\-]+)"
    """
    try:
        with open(filename, "r", encoding="utf-8") as f:
            text = f.read()

        pattern = r'(?:SKU|[Аа]ртикул)\s*:?\s*([A-Za-zА-Яа-я0-9\-]+)'

        r'''(?:SKU|[Аа]ртикул) — ищем слово "SKU" или "артикул"/"Артикул"
        \s*                   — любое количество пробелов (может быть 0);
        :?                    — необязательное двоеточие;
        \s*                   — снова любое количество пробелов;
        [A-Za-zА-Яа-я0-9\-]+  — код артикула.'''

        sku_list = re.findall(pattern, text)
        return sku_list
    except FileNotFoundError:
        print(f"Ошибка: файл '{filename}' не найден. "
              f"Убедитесь, что он находится в той же папке, что и скрипт.")


filename = "тест.txt"
print(extract_sku_list(filename))
